##### Use to exclude duplicate answers 
1- SQL DISTINCT

##### For Even Number
2- WHERE ID%2=0

#### Difference between unique city and number of cities
3- SELECT COUNT(CITY) - COUNT(DISTINCT(CITY)) FROM STATION

#### Shortest city  name
4- SELECT CITY.LENGTH(CITY) AS LENGTH FROM STATION ORDER BY LENGTH, CITY LIMIT 1

##### Longest city name
5- SELECT CITY.LENGTH(CITY) AS LENGTH FROM STATION ORDER BY LENGTH DESC, CITY LIMIT 1

##### Select all city names starting with vowels 
6- SELECT DISTINCT(CITY) FROM STATION WHERE LEFT(CITY,1) IN ('a','e','o','I','u')

##### Select all city names ending with vowels

7- SELECT DISTINCT(CITY) FROM STATION WHERE RIGHT(CITY,1) IN ('a','e','o','I','u')

##### Select all city names DOESN'T start with vowels
8-  SELECT DISTINCT(CITY) FROM STATION WHERE LEFT(CITY,1) NOT IN ('a','e','o','I','u')

##### Query the Name of any student in STUDENTS who scored higher than  Marks. Order your output by the last three characters of each name. If two or more students both have names ending in the same last three characters (i.e.: Bobby, Robby, etc.), secondary sort them by ascending ID.

9- SELECT Name FROM STUDENTS WHERE Marks > 75 ORDER BY RIGHT(Name, 3), ID ASC;

#### Write a query that prints a list of employee names (i.e.: the name attribute) from the Employee table in alphabetical order.

10 - SELECT NAME FROM EMPLOYEE ORDER BY NAME

#### Write a query that prints a list of employee names (i.e.: the name attribute) for employees in Employee having a salary greater than  per month who have been employees for less than  months. Sort your result by ascending employee_id.

11 - SELECT NAME FROM EMPLOYEE WHERE MONTHS < 10 AND SALARY > 2000 ORDER BY EMPLOYEE_ID ASC